// for(let i = 0; i < 10; i++){
//     console.log("홍길동")
// }

// // ===== 1234를 3번 반복해서 123412341234 출력하기 =====

// let result = ""   // 숫자를 이어 붙일 빈 문자열

// for (let i = 0; i < 12; i++) {   // 총 12자리이므로 12번 반복 (i: 0 ~ 11)
//     result += (i % 4) + 1        // i를 4로 나눈 나머지(0~3)에 1을 더해 1~4를 만듦
// }

// console.log(result)   // 123412341234



// // ===== 1~100까지 홀수만 이어서 출력하기 =====

// let odd = ""   // 홀수를 이어 붙일 빈 문자열

// for (let i = 1; i <= 100; i += 2) {   // 1부터 시작해서 2씩 증가 → 1, 3, 5, ... 99
//     odd += i                          // 홀수를 문자열에 이어 붙임
// }

// console.log(odd)   // 13579111315...99


// // ===== 1~100까지 모두 더하기 =====

// let sum = 0   // 합계를 저장할 변수 (0부터 시작)

// for (let i = 1; i <= 100; i++) {   // 1부터 100까지 1씩 증가하며 반복
//     sum += i                       // sum = sum + i : 현재 숫자를 합계에 더함
// }

// console.log("1~100까지의 합: " + sum)   // 5050

//1~100까지 중 7의 배수를 출력하세요.
for(let i = 0; i < 100; i++){
    if(i % 7 === 0)
        console.log(i)
}

// 구구단 2단 만들기
for(let i = 1; i < 10; i++){
    console.log("2 X " + i + " = " + 2 * i)
}

//2단 ~ 9단까지 구구단 만들기
for(let i = 2; i < 10; i++){
    for(let j = 1; j < 10; j++){
        console.log(`${i} X ${j} = ${i * j}`)
    }
}